A1/httperf-logs/apache/test1.txt
httperf --timeout=5 --client=0/1 --server=192.168.0.32 --port=80 --uri=/www.cs.toronto.edu/~ylzhang/csc258/memes.html --rate=10 --send-buffer=4096 --recv-buffer=16384 --num-conns=100 --num-calls=10
Maximum connect burst length: 1

Total: connections 100 requests 1000 replies 1000 test-duration 9.902 s

Connection rate: 10.1 conn/s (99.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 0.9 avg 1.3 max 4.3 median 1.5 stddev 0.4
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 10.000

Request rate: 101.0 req/s (9.9 ms/req)
Request size [B]: 110.0

Reply rate [replies/s]: min 100.0 avg 100.0 max 100.0 stddev 0.0 (1 samples)
Reply time [ms]: response 0.1 transfer 0.0
Reply size [B]: header 254.0 content 4148.0 footer 0.0 (total 4402.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.32 system 4.57 (user 53.7% system 46.1% total 99.9%)
Net I/O: 445.0 KB/s (3.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0