A1/httperf-logs/apache/test3.txt
httperf --timeout=5 --client=0/1 --server=192.168.0.32 --port=80 --uri=/www.cs.toronto.edu/~ylzhang/csc258/memes.html --rate=10 --send-buffer=4096 --recv-buffer=16384 --num-conns=100 --num-calls=30
Maximum connect burst length: 1

Total: connections 100 requests 3000 replies 3000 test-duration 9.903 s

Connection rate: 10.1 conn/s (99.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 2.3 avg 3.1 max 5.7 median 3.5 stddev 0.6
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 30.000

Request rate: 302.9 req/s (3.3 ms/req)
Request size [B]: 110.0

Reply rate [replies/s]: min 300.0 avg 300.0 max 300.0 stddev 0.0 (1 samples)
Reply time [ms]: response 0.1 transfer 0.0
Reply size [B]: header 254.0 content 4148.0 footer 0.0 (total 4402.0)
Reply status: 1xx=0 2xx=3000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.27 system 4.61 (user 53.2% system 46.6% total 99.8%)
Net I/O: 1334.8 KB/s (10.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0